---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
source: html/f50c1cf5-f80e-c2c2-93d7-601d074dc96c.htm
---
# AnalyticalDistributionNodePropertyData Properties

Specifies whether the .NET object represents a valid Revit entity.